run/vawt_test_rotor/system/meshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      meshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFile     "domain_rotor.fms";

maxCellSize     0.025;



objectRefinements
{

}

edgeMeshRefinement
{

}

localRefinement
{
	Rotor
	{
		additionalRefinementLevels 2;
		refinementThickness 0.1; //cm
	}
}

boundaryLayers
{
	patchBoundaryLayers
	{
		Rotor
		{
			nLayers 5;
			thicknessRatio 1.1;
			maxFirstLayerThickness 1;
			allowDiscontinuity 1;
		}
	}
}


// ************************************************************************* //
